source/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user = User.find_by_id(params[:id])

SELECT 1 FROM "users" WHERE "users"."pseudonym" = '' LIMIT 1
INSERT INTO "users" ("admin", "created_at", "email", "first_name", "password_digest", "pseudonym", "remember_token", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    full_name = "#{@user.first_name} #{@user.surname}"
    full_name = full_name.gsub(" ", "_")
    count = 0
    while !( ( User.find_by_pseudonym("#{full_name}") ).nil? ) do
      count += 1
      puts count
      if( full_name.index(/_(\d+)/).nil? )
        full_name = full_name + "_#{count}"
      else
        full_name = full_name.gsub!(/_(\d+)$/, "_#{count}")
      end
    end
    @user.pseudonym = full_name

    if @user.save

UPDATE "users" SET "pseudonym" = 'ajdempsey', "password_digest" = '$2a$10$5DKgPfK2FbjzJeGnfLPeQOZNgnHg3oTI/vtHbRJ.mrSbUPzKF40gS', "remember_token" = 'QrNOBhi8GljZ5_yMtCM89w', "updated_at" = '2012-06-02 12:39:07.246464' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
  def destroy
    @user = User.find_by_id(params[:id])
    if !@user.nil?
      @user.destroy