rails_prototype/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("admin", "created_at", "email", "first_name", "password_digest", "remember_token", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "surname" = 'Awesome', "password_digest" = '$2a$10$CaTPJYJ.I.zTLxQIMBKjgu4qaN2SEe5zyR4EDX3L5jRtHTTKLt3sC', "remember_token" = 'q7N0vE7bRDL794uw7wvhqA', "updated_at" = '2012-06-01 12:31:33.057871' WHERE "users"."id" = 1